## Importing libraries

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## Importing data

In [2]:
# Defining path
path = r'C:\Users\Rachele\Documents\Data Analytics Course\CareerFoundry\Data Analytics Immersion\Achievement 4\Python'

In [4]:
# Importing orders dataframe
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original', 'customers.csv'))

In [18]:
#Imported ords_prods_merge_updated_2.pkl
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data','ords_prods_merge_updated_2.pkl'))

In [5]:
#checking data
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

### Step 5

In [7]:
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [8]:
customers.rename(columns = {'Surnam': 'Last Name'}, inplace = True)

In [9]:
#Renamed 'n_dependants' to '# of dependants'
customers.rename(columns = {'n_dependants': 'Number_of_Dependants'}, inplace = True)

In [10]:
#Renamed 'STATE' to 'State'
customers.rename(columns = {'STATE': 'State'}, inplace = True)

In [11]:
#Check for missing values 
customers.isnull().sum()

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
date_joined                 0
Number_of_Dependants        0
fam_status                  0
income                      0
dtype: int64

In [12]:
#Changing missing values to nan
df_nan = customers[customers['First Name'].isnull() == True]

In [13]:
#Check for data consistentcy - mixed types
for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

First Name

In [14]:
#Changed 'First Name' to a string
customers['First Name'] = customers['First Name'].astype('str')

In [15]:
#Check for duplicates
df_duplicates = customers[customers.duplicated()]

In [16]:
df_duplicates

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, date_joined, Number_of_Dependants, fam_status, income]
Index: []

### Step 6

In [19]:
#Check data types
ords_prods_merge.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_last_order     float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
Unnamed: 0_y                int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
_merge                   category
busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
average_price             float64
spending_flag              object
median_prior_orders       float64
order_frequency_flag       object
dtype: object

In [26]:
#Change 'user_id' to string to be consisent w/customer_data
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('int64')

In [27]:
print(ords_prods_merge['user_id'].dtypes)

int64

In [25]:
print(customers['user_id'].dtypes)

int64

In [28]:
#Merge the data sets on the 'user_id' column
df_combined = ords_prods_merge.merge(customers, on = 'user_id')

In [29]:
# Cleaning up the column headers so they're consistent. Turned uppercase column names to lower case.
df_combined.rename(columns = {'First Name' : 'first_name', 'Last Name' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'Number of Dependants' : 'number_of_dependants', 'fam_status' : 'marital_status'}, inplace = True)

In [30]:
df_combined.to_pickle(os.path.join(path, '02 Data', 'Prepared Data','customer_merged.pkl'))